Public Attributes | List of all members
API_DocumentFrom3DType Struct Reference
View Handling
Represents a 3D Document. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_3DFilterAndCutSettings  | filterAndCutSettings
Tells which elements should appear in the 3D document window. Corresponds to the Filter and Cut Settings dialog.
API_3DCutPlanesInfo  | cutSetting
List of cut planes to apply.
bool  | cutaway3D
Apply 3D cut away.
API_3DProjectionInfo  | projectionSetting
Projection settings (camera position etc.)
API_Coord  | floorPlanRotationOrigo
2D floorplan origo offset (only in skeleton drawing).
API_3DWindowInfo  | window3DInfo
Appearance settings of the 3D window.
API_AttributeIndex  | hiddenLineType
Linetype index for hidden lines .
short  | hiddenLineLen
short  | effects3D
Effects to apply.
API_Rect  | drawRect
Rect.
API_UniformAttributeOptions  | attributeOptions
List of uniform attributes if attributeOptions.shouldUseUniformCutAttributes is set.
API_CutPlanePlanConn  | currPlanConn
Current Plan connectivity.
API_CutPlanePlanConn  | intPlanConn
Intended Plan connectivity.
bool  | materialFrom3D
Use materials from the 3D window.
API_DocumentSourceID  | docSrc
3D Document source.
API_SkeletonOptions  | skeletonOptions
Skeleton drawing options.
API_BoundaryDisplay  | boundaryDisplay
Boundary display options.
short  | boundaryPen
Boundary pen (in case of overridden contours)
API_AttributeIndex  | boundaryLineType
Boundary line type (in case of overridden contours)
bool  | transparency
Enable transparent surfaces in 3D window.
Detailed Description
Represents a 3D Document.
Since
Archicad 26
Remarks
This structure is used by the ACAPI_View_GetDocumentFrom3DSettings and the ACAPI_View_ChangeDocumentFrom3DSettings environment functions.
Member Data Documentation
◆ attributeOptions
 API_DocumentFrom3DType::attributeOptions
List of uniform attributes if attributeOptions.shouldUseUniformCutAttributes is set.
◆ boundaryDisplay
 API_DocumentFrom3DType::boundaryDisplay
Boundary display options.
◆ boundaryLineType
 API_DocumentFrom3DType::boundaryLineType
Boundary line type (in case of overridden contours)
◆ boundaryPen
 API_DocumentFrom3DType::boundaryPen
Boundary pen (in case of overridden contours)
◆ currPlanConn
 API_DocumentFrom3DType::currPlanConn
Current Plan connectivity.
◆ cutaway3D
 API_DocumentFrom3DType::cutaway3D
Apply 3D cut away.
◆ cutSetting
 API_DocumentFrom3DType::cutSetting
List of cut planes to apply.
◆ docSrc
 API_DocumentFrom3DType::docSrc
3D Document source.
◆ drawRect
 API_DocumentFrom3DType::drawRect
Rect.
◆ effects3D
 API_DocumentFrom3DType::effects3D
Effects to apply.
◆ filterAndCutSettings
 API_DocumentFrom3DType::filterAndCutSettings
Tells which elements should appear in the 3D document window. Corresponds to the Filter and Cut Settings dialog.
◆ floorPlanRotationOrigo
 API_DocumentFrom3DType::floorPlanRotationOrigo
2D floorplan origo offset (only in skeleton drawing).
◆ hiddenLineLen
 short API_DocumentFrom3DType::hiddenLineLen
◆ hiddenLineType
 API_DocumentFrom3DType::hiddenLineType
Linetype index for hidden lines .
◆ intPlanConn
 API_DocumentFrom3DType::intPlanConn
Intended Plan connectivity.
◆ materialFrom3D
 API_DocumentFrom3DType::materialFrom3D
Use materials from the 3D window.
◆ projectionSetting
 API_DocumentFrom3DType::projectionSetting
Projection settings (camera position etc.)
◆ skeletonOptions
 API_DocumentFrom3DType::skeletonOptions
Skeleton drawing options.
◆ transparency
 API_DocumentFrom3DType::transparency
Enable transparent surfaces in 3D window.
◆ window3DInfo
 API_DocumentFrom3DType::window3DInfo
Appearance settings of the 3D window.